---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.Erase(Autodesk.Revit.DB.ProjectLocation)
source: html/15e5616e-cd52-e6f6-5483-0c2843925232.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.Erase Method

Removes a specified project location from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	ProjectLocation item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ProjectLocation`) - The project location to be erased.

## Returns
The number of project locations that were erased from the set.